//======================================================\\
//                  Задача 52.                          \\
//  Задайте двумерный массив из целых чисел. Найдите    \\
//  среднее арифметическое элементов в каждом столбце.  \\
//                                                      \\
//  Например:                                           \\
//      1 4 7 2                                         \\
//      5 9 2 3                                         \\
//      8 4 2 4                                         \\
//                                                      \\
//  Среднее арифметическое каждого столбца:             \\
//      4,6; 5,6; 3,6; 3.                               \\
//                                                      \\
//======================================================\\

int[,] array = {{1, 4, 7, 2},
                {5, 9, 2, 3},
                {8, 4, 2, 4}};

for (int j = 0; j < array.GetLength(1); j++) {
    double sum = 0;
    for (int i = 0; i < array.GetLength(0); i++) {
        sum += array[i, j];
    }
    Console.Write("{0,5:F2}", sum / array.GetLength(0));
}
