//==================================================\\
//                  Задача 44.                      \\
//  Не используя рекурсию, выведите первые N чисел  \\
//  Фибоначчи. Первые два числа Фибоначчи: 0 и 1.   \\
//                                                  \\
//  Пример:                                         \\
//      Если N = 5 -> 0 1 1 2 3                     \\
//      Если N = 3 -> 0 1 1                         \\
//      Если N = 7 -> 0 1 1 2 3 5 8                 \\
//==================================================\\

Console.Write("Введите число: ");
int N = Convert.ToInt32(Console.ReadLine());
int i = 2;
if (N >= i) {
    int[] fib = new int[N];
    fib[0] = 0;
    fib[1] = 1;
    Console.Write($"{fib[0]} {fib[1]} ");

    while (i < N) {
        fib[i] = fib[i - 1] + fib[i - 2];
        Console.Write($"{fib[i]} ");
        i++;
    }
} else {
    Console.Write("Некорректный ввод.");
}

