//==========================================================\\
//                  Задача 33.                              \\
//  Задайте массив. Напишите программу, которая определяет, \\
//  присутствует ли заданное число в массиве                \\
//                                                          \\
//   4; массив [6, 7, 19, 345, 3]  -> нет                   \\
//  -3; массив [6, 7, 19, 345, -3] ->  да                   \\
//==========================================================\\

Console.Write("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());

int[] arr = {6, 7, 19, 345, 3};

bool flag = false;

for (int i = 0; i < arr.Length; i++) {
    if (arr[i] == num) {
        flag = true;
        break;
    } 
}
if (flag == true) {
    Console.Write("Да");
} else {
    Console.Write("Нет");
}
