//==========================================================\\
//                  Задача 41.                              \\
//  Пользователь вводит с клавиатуры M чисел. Посчитайте,   \\
//  сколько чисел больше 0 ввел пользователь.               \\
//                                                          \\
//  Пример:                                                 \\
//      0, 7, 8, -2         -> 2                            \\
//      1, -7, 567, 89, 223 -> 3                            \\
//==========================================================\\

Console.WriteLine("Сколько чисел вы хотите ввести?");
int count = Convert.ToInt32(Console.ReadLine());
int pos = 0;

Console.WriteLine("Хорошо, начинайте ввод: ");
while (count > 0) {
    int enter = Convert.ToInt32(Console.ReadLine());
    if (enter > 0) {
        pos++;
    }
    count--;
}

Console.Write("Количество положительных чисел: " + pos);