//==============================================================\\
//                  Задача 31.                                  \\
//      Задайте массив из 12 элементов, заполненный случайными  \\
//  числами из промежутка [-9, 9]. Найдите сумму отрицательных  \\
//  и положительных элементов массива.                          \\
//                                                              \\
//  Например:                                                   \\
//  в массиве [3, 9, -8, 1, 0, -7, 2, -1, 8, -3, -1, 6]         \\
//  сумма положительных чисел равна 29, сумма отрицательных     \\
//  равна -20.                                                  \\
//==============================================================\\

int[] numArr = new int[12];
int positive = 0;
int negative = 0;

for (int i = 0; i < numArr.Length; i++) {
    numArr[i] = new Random().Next(-9, 10);
    if (numArr[i] > 0) {
        positive += numArr[i];
    } else {
        negative += numArr[i];
    }
}

Console.Write("[" + String.Join(", ", numArr) + "]" 
             + "\nСумма положительных чисел: " + positive
             + "\nСумма отрицательных чисел: " + negative);
